Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 4, 200, 1)]  0                                            
__________________________________________________________________________________________________
Spectral_filter_1 (Conv2D)      (None, 4, 200, 2)    32          input_1[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_2 (Conv2D)      (None, 4, 200, 4)    128         input_1[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_3 (Conv2D)      (None, 4, 200, 8)    512         input_1[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_4 (Conv2D)      (None, 4, 200, 16)   2048        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 4, 200, 2)    8           Spectral_filter_1[0][0]          
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 4, 200, 4)    16          Spectral_filter_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 4, 200, 8)    32          Spectral_filter_3[0][0]          
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 4, 200, 16)   64          Spectral_filter_4[0][0]          
__________________________________________________________________________________________________
Spatial_filter_1 (DepthwiseConv (None, 1, 200, 2)    8           batch_normalization[0][0]        
__________________________________________________________________________________________________
Spatial_filter_2 (DepthwiseConv (None, 1, 200, 4)    16          batch_normalization_2[0][0]      
__________________________________________________________________________________________________
Spatial_filter_3 (DepthwiseConv (None, 1, 200, 8)    32          batch_normalization_4[0][0]      
__________________________________________________________________________________________________
Spatial_filter_4 (DepthwiseConv (None, 1, 200, 16)   64          batch_normalization_6[0][0]      
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 1, 200, 2)    8           Spatial_filter_1[0][0]           
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 1, 200, 4)    16          Spatial_filter_2[0][0]           
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 1, 200, 8)    32          Spatial_filter_3[0][0]           
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 1, 200, 16)   64          Spatial_filter_4[0][0]           
__________________________________________________________________________________________________
activation (Activation)         (None, 1, 200, 2)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1, 200, 4)    0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 1, 200, 8)    0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 1, 200, 16)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1, 200, 30)   0           activation[0][0]                 
                                                                 activation_1[0][0]               
                                                                 activation_2[0][0]               
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 1, 50, 30)    0           concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1, 50, 30)    0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
tf_op_layer_Pad (TensorFlowOpLa [(None, 1, 53, 30)]  0           dropout[0][0]                    
__________________________________________________________________________________________________
depthwise_conv2d (DepthwiseConv (None, 1, 50, 30)    150         tf_op_layer_Pad[0][0]            
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 1, 50, 30)    120         depthwise_conv2d[0][0]           
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 1, 50, 30)    0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1, 50, 30)    0           activation_4[0][0]               
__________________________________________________________________________________________________
tf_op_layer_Pad_1 (TensorFlowOp [(None, 1, 53, 30)]  0           dropout_1[0][0]                  
__________________________________________________________________________________________________
depthwise_conv2d_1 (DepthwiseCo (None, 1, 50, 30)    150         tf_op_layer_Pad_1[0][0]          
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 1, 50, 30)    120         depthwise_conv2d_1[0][0]         
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 1, 50, 30)    0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1, 50, 30)    0           activation_5[0][0]               
__________________________________________________________________________________________________
add (Add)                       (None, 1, 50, 30)    0           dropout[0][0]                    
                                                                 dropout_2[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Pad_2 (TensorFlowOp [(None, 1, 56, 30)]  0           add[0][0]                        
__________________________________________________________________________________________________
depthwise_conv2d_2 (DepthwiseCo (None, 1, 50, 30)    150         tf_op_layer_Pad_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 1, 50, 30)    120         depthwise_conv2d_2[0][0]         
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 1, 50, 30)    0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1, 50, 30)    0           activation_6[0][0]               
__________________________________________________________________________________________________
tf_op_layer_Pad_3 (TensorFlowOp [(None, 1, 56, 30)]  0           dropout_3[0][0]                  
__________________________________________________________________________________________________
depthwise_conv2d_3 (DepthwiseCo (None, 1, 50, 30)    150         tf_op_layer_Pad_3[0][0]          
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 1, 50, 30)    120         depthwise_conv2d_3[0][0]         
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 1, 50, 30)    0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 1, 50, 30)    0           activation_7[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 1, 50, 30)    0           add[0][0]                        
                                                                 dropout_4[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Pad_4 (TensorFlowOp [(None, 1, 62, 30)]  0           add_1[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_4 (DepthwiseCo (None, 1, 50, 30)    150         tf_op_layer_Pad_4[0][0]          
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 1, 50, 30)    120         depthwise_conv2d_4[0][0]         
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 1, 50, 30)    0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 1, 50, 30)    0           activation_8[0][0]               
__________________________________________________________________________________________________
tf_op_layer_Pad_5 (TensorFlowOp [(None, 1, 62, 30)]  0           dropout_5[0][0]                  
__________________________________________________________________________________________________
depthwise_conv2d_5 (DepthwiseCo (None, 1, 50, 30)    150         tf_op_layer_Pad_5[0][0]          
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 1, 50, 30)    120         depthwise_conv2d_5[0][0]         
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 1, 50, 30)    0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 1, 50, 30)    0           activation_9[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, 1, 50, 30)    0           add_1[0][0]                      
                                                                 dropout_6[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Pad_6 (TensorFlowOp [(None, 1, 74, 30)]  0           add_2[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_6 (DepthwiseCo (None, 1, 50, 30)    150         tf_op_layer_Pad_6[0][0]          
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 1, 50, 30)    120         depthwise_conv2d_6[0][0]         
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 1, 50, 30)    0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 1, 50, 30)    0           activation_10[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_7 (TensorFlowOp [(None, 1, 74, 30)]  0           dropout_7[0][0]                  
__________________________________________________________________________________________________
depthwise_conv2d_7 (DepthwiseCo (None, 1, 50, 30)    150         tf_op_layer_Pad_7[0][0]          
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 1, 50, 30)    120         depthwise_conv2d_7[0][0]         
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 1, 50, 30)    0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 1, 50, 30)    0           activation_11[0][0]              
__________________________________________________________________________________________________
add_3 (Add)                     (None, 1, 50, 30)    0           add_2[0][0]                      
                                                                 dropout_8[0][0]                  
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 1, 50, 28)    868         add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 1, 50, 28)    112         conv2d[0][0]                     
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 1, 50, 28)    0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 12, 28)    0           activation_12[0][0]              
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 1, 12, 28)    0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
flatten (Flatten)               (None, 336)          0           dropout_9[0][0]                  
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 7)            2359        flatten[0][0]                    
==================================================================================================
Total params: 8,579
Trainable params: 7,923
Non-trainable params: 656
__________________________________________________________________________________________________
