Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 4, 600, 1)]  0                                            
__________________________________________________________________________________________________
Spectral_filter_1 (Conv2D)      (None, 4, 600, 2)    32          input_3[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_2 (Conv2D)      (None, 4, 600, 4)    128         input_3[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_3 (Conv2D)      (None, 4, 600, 8)    512         input_3[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_4 (Conv2D)      (None, 4, 600, 16)   2048        input_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 4, 600, 2)    8           Spectral_filter_1[0][0]          
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 4, 600, 4)    16          Spectral_filter_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 4, 600, 8)    32          Spectral_filter_3[0][0]          
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 4, 600, 16)   64          Spectral_filter_4[0][0]          
__________________________________________________________________________________________________
Spatial_filter_1 (DepthwiseConv (None, 1, 600, 2)    8           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
Spatial_filter_2 (DepthwiseConv (None, 1, 600, 4)    16          batch_normalization_36[0][0]     
__________________________________________________________________________________________________
Spatial_filter_3 (DepthwiseConv (None, 1, 600, 8)    32          batch_normalization_38[0][0]     
__________________________________________________________________________________________________
Spatial_filter_4 (DepthwiseConv (None, 1, 600, 16)   64          batch_normalization_40[0][0]     
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 1, 600, 2)    8           Spatial_filter_1[0][0]           
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 1, 600, 4)    16          Spatial_filter_2[0][0]           
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 1, 600, 8)    32          Spatial_filter_3[0][0]           
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 1, 600, 16)   64          Spatial_filter_4[0][0]           
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 1, 600, 2)    0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 1, 600, 4)    0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 1, 600, 8)    0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 1, 600, 16)   0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1, 600, 30)   0           activation_26[0][0]              
                                                                 activation_27[0][0]              
                                                                 activation_28[0][0]              
                                                                 activation_29[0][0]              
__________________________________________________________________________________________________
average_pooling2d_4 (AveragePoo (None, 1, 150, 30)   0           concatenate_2[0][0]              
__________________________________________________________________________________________________
dropout_22 (Dropout)            (None, 1, 150, 30)   0           average_pooling2d_4[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Pad_16 (TensorFlowO [(None, 1, 153, 30)] 0           dropout_22[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_16 (DepthwiseC (None, 1, 150, 30)   150         tf_op_layer_Pad_16[0][0]         
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 1, 150, 30)   120         depthwise_conv2d_16[0][0]        
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 1, 150, 30)   0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
dropout_23 (Dropout)            (None, 1, 150, 30)   0           activation_30[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_17 (TensorFlowO [(None, 1, 153, 30)] 0           dropout_23[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_17 (DepthwiseC (None, 1, 150, 30)   150         tf_op_layer_Pad_17[0][0]         
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 1, 150, 30)   120         depthwise_conv2d_17[0][0]        
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 1, 150, 30)   0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
dropout_24 (Dropout)            (None, 1, 150, 30)   0           activation_31[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 1, 150, 30)   0           dropout_22[0][0]                 
                                                                 dropout_24[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Pad_18 (TensorFlowO [(None, 1, 156, 30)] 0           add_8[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_18 (DepthwiseC (None, 1, 150, 30)   150         tf_op_layer_Pad_18[0][0]         
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 1, 150, 30)   120         depthwise_conv2d_18[0][0]        
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 1, 150, 30)   0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
dropout_25 (Dropout)            (None, 1, 150, 30)   0           activation_32[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_19 (TensorFlowO [(None, 1, 156, 30)] 0           dropout_25[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_19 (DepthwiseC (None, 1, 150, 30)   150         tf_op_layer_Pad_19[0][0]         
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 1, 150, 30)   120         depthwise_conv2d_19[0][0]        
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 1, 150, 30)   0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
dropout_26 (Dropout)            (None, 1, 150, 30)   0           activation_33[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, 1, 150, 30)   0           add_8[0][0]                      
                                                                 dropout_26[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Pad_20 (TensorFlowO [(None, 1, 162, 30)] 0           add_9[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_20 (DepthwiseC (None, 1, 150, 30)   150         tf_op_layer_Pad_20[0][0]         
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 1, 150, 30)   120         depthwise_conv2d_20[0][0]        
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 1, 150, 30)   0           batch_normalization_46[0][0]     
__________________________________________________________________________________________________
dropout_27 (Dropout)            (None, 1, 150, 30)   0           activation_34[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_21 (TensorFlowO [(None, 1, 162, 30)] 0           dropout_27[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_21 (DepthwiseC (None, 1, 150, 30)   150         tf_op_layer_Pad_21[0][0]         
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 1, 150, 30)   120         depthwise_conv2d_21[0][0]        
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 1, 150, 30)   0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
dropout_28 (Dropout)            (None, 1, 150, 30)   0           activation_35[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, 1, 150, 30)   0           add_9[0][0]                      
                                                                 dropout_28[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Pad_22 (TensorFlowO [(None, 1, 174, 30)] 0           add_10[0][0]                     
__________________________________________________________________________________________________
depthwise_conv2d_22 (DepthwiseC (None, 1, 150, 30)   150         tf_op_layer_Pad_22[0][0]         
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 1, 150, 30)   120         depthwise_conv2d_22[0][0]        
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 1, 150, 30)   0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
dropout_29 (Dropout)            (None, 1, 150, 30)   0           activation_36[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_23 (TensorFlowO [(None, 1, 174, 30)] 0           dropout_29[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_23 (DepthwiseC (None, 1, 150, 30)   150         tf_op_layer_Pad_23[0][0]         
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 1, 150, 30)   120         depthwise_conv2d_23[0][0]        
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 1, 150, 30)   0           batch_normalization_49[0][0]     
__________________________________________________________________________________________________
dropout_30 (Dropout)            (None, 1, 150, 30)   0           activation_37[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, 1, 150, 30)   0           add_10[0][0]                     
                                                                 dropout_30[0][0]                 
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 1, 150, 28)   868         add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (None, 1, 150, 28)   112         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 1, 150, 28)   0           batch_normalization_50[0][0]     
__________________________________________________________________________________________________
average_pooling2d_5 (AveragePoo (None, 1, 37, 28)    0           activation_38[0][0]              
__________________________________________________________________________________________________
dropout_31 (Dropout)            (None, 1, 37, 28)    0           average_pooling2d_5[0][0]        
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 1036)         0           dropout_31[0][0]                 
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 7)            7259        flatten_2[0][0]                  
==================================================================================================
Total params: 13,479
Trainable params: 12,823
Non-trainable params: 656
__________________________________________________________________________________________________
