Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 4, 400, 1)]  0                                            
__________________________________________________________________________________________________
Spectral_filter_0 (Conv2D)      (None, 4, 400, 4)    32          input_2[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_1 (Conv2D)      (None, 4, 400, 8)    128         input_2[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_2 (Conv2D)      (None, 4, 400, 16)   512         input_2[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_3 (Conv2D)      (None, 4, 400, 32)   2048        input_2[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_4 (Conv2D)      (None, 4, 400, 64)   8192        input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 4, 400, 4)    16          Spectral_filter_0[0][0]          
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 4, 400, 8)    32          Spectral_filter_1[0][0]          
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 4, 400, 16)   64          Spectral_filter_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 4, 400, 32)   128         Spectral_filter_3[0][0]          
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 4, 400, 64)   256         Spectral_filter_4[0][0]          
__________________________________________________________________________________________________
Spatial_filter_0 (DepthwiseConv (None, 1, 400, 16)   64          batch_normalization_21[0][0]     
__________________________________________________________________________________________________
Spatial_filter_1 (DepthwiseConv (None, 1, 400, 32)   128         batch_normalization_23[0][0]     
__________________________________________________________________________________________________
Spatial_filter_2 (DepthwiseConv (None, 1, 400, 64)   256         batch_normalization_25[0][0]     
__________________________________________________________________________________________________
Spatial_filter_3 (DepthwiseConv (None, 1, 400, 128)  512         batch_normalization_27[0][0]     
__________________________________________________________________________________________________
Spatial_filter_4 (DepthwiseConv (None, 1, 400, 256)  1024        batch_normalization_29[0][0]     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 1, 400, 16)   64          Spatial_filter_0[0][0]           
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 1, 400, 32)   128         Spatial_filter_1[0][0]           
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 1, 400, 64)   256         Spatial_filter_2[0][0]           
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 1, 400, 128)  512         Spatial_filter_3[0][0]           
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 1, 400, 256)  1024        Spatial_filter_4[0][0]           
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 1, 400, 16)   0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 1, 400, 32)   0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 1, 400, 64)   0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 1, 400, 128)  0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 1, 400, 256)  0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1, 400, 496)  0           activation_16[0][0]              
                                                                 activation_17[0][0]              
                                                                 activation_18[0][0]              
                                                                 activation_19[0][0]              
                                                                 activation_20[0][0]              
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 1, 100, 496)  0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 1, 100, 496)  0           average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Pad_10 (TensorFlowO [(None, 1, 103, 496) 0           dropout_11[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_10 (DepthwiseC (None, 1, 100, 496)  2480        tf_op_layer_Pad_10[0][0]         
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 1, 100, 496)  1984        depthwise_conv2d_10[0][0]        
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 1, 100, 496)  0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 1, 100, 496)  0           activation_21[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_11 (TensorFlowO [(None, 1, 103, 496) 0           dropout_12[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_11 (DepthwiseC (None, 1, 100, 496)  2480        tf_op_layer_Pad_11[0][0]         
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 1, 100, 496)  1984        depthwise_conv2d_11[0][0]        
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 1, 100, 496)  0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 1, 100, 496)  0           activation_22[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 1, 100, 496)  0           dropout_11[0][0]                 
                                                                 dropout_13[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Pad_12 (TensorFlowO [(None, 1, 106, 496) 0           add_5[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_12 (DepthwiseC (None, 1, 100, 496)  2480        tf_op_layer_Pad_12[0][0]         
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 1, 100, 496)  1984        depthwise_conv2d_12[0][0]        
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 1, 100, 496)  0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 1, 100, 496)  0           activation_23[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_13 (TensorFlowO [(None, 1, 106, 496) 0           dropout_14[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_13 (DepthwiseC (None, 1, 100, 496)  2480        tf_op_layer_Pad_13[0][0]         
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 1, 100, 496)  1984        depthwise_conv2d_13[0][0]        
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 1, 100, 496)  0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 1, 100, 496)  0           activation_24[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 1, 100, 496)  0           add_5[0][0]                      
                                                                 dropout_15[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Pad_14 (TensorFlowO [(None, 1, 112, 496) 0           add_6[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_14 (DepthwiseC (None, 1, 100, 496)  2480        tf_op_layer_Pad_14[0][0]         
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 1, 100, 496)  1984        depthwise_conv2d_14[0][0]        
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 1, 100, 496)  0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 1, 100, 496)  0           activation_25[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_15 (TensorFlowO [(None, 1, 112, 496) 0           dropout_16[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_15 (DepthwiseC (None, 1, 100, 496)  2480        tf_op_layer_Pad_15[0][0]         
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 1, 100, 496)  1984        depthwise_conv2d_15[0][0]        
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 1, 100, 496)  0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 1, 100, 496)  0           activation_26[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 1, 100, 496)  0           add_6[0][0]                      
                                                                 dropout_17[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Pad_16 (TensorFlowO [(None, 1, 124, 496) 0           add_7[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_16 (DepthwiseC (None, 1, 100, 496)  2480        tf_op_layer_Pad_16[0][0]         
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 1, 100, 496)  1984        depthwise_conv2d_16[0][0]        
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 1, 100, 496)  0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
dropout_18 (Dropout)            (None, 1, 100, 496)  0           activation_27[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_17 (TensorFlowO [(None, 1, 124, 496) 0           dropout_18[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_17 (DepthwiseC (None, 1, 100, 496)  2480        tf_op_layer_Pad_17[0][0]         
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 1, 100, 496)  1984        depthwise_conv2d_17[0][0]        
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 1, 100, 496)  0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
dropout_19 (Dropout)            (None, 1, 100, 496)  0           activation_28[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 1, 100, 496)  0           add_7[0][0]                      
                                                                 dropout_19[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Pad_18 (TensorFlowO [(None, 1, 148, 496) 0           add_8[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_18 (DepthwiseC (None, 1, 100, 496)  2480        tf_op_layer_Pad_18[0][0]         
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 1, 100, 496)  1984        depthwise_conv2d_18[0][0]        
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 1, 100, 496)  0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
dropout_20 (Dropout)            (None, 1, 100, 496)  0           activation_29[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_19 (TensorFlowO [(None, 1, 148, 496) 0           dropout_20[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_19 (DepthwiseC (None, 1, 100, 496)  2480        tf_op_layer_Pad_19[0][0]         
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 1, 100, 496)  1984        depthwise_conv2d_19[0][0]        
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 1, 100, 496)  0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
dropout_21 (Dropout)            (None, 1, 100, 496)  0           activation_30[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, 1, 100, 496)  0           add_8[0][0]                      
                                                                 dropout_21[0][0]                 
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1, 100, 28)   13916       add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 1, 100, 28)   112         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 1, 100, 28)   0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 1, 25, 28)    0           activation_31[0][0]              
__________________________________________________________________________________________________
dropout_22 (Dropout)            (None, 1, 25, 28)    0           average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
flatten (Flatten)               (None, 700)          0           dropout_22[0][0]                 
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          89728       flatten[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           8256        dense[0][0]                      
__________________________________________________________________________________________________
dropout_23 (Dropout)            (None, 64)           0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           2080        dropout_23[0][0]                 
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 7)            231         dense_2[0][0]                    
==================================================================================================
Total params: 174,339
Trainable params: 163,123
Non-trainable params: 11,216
__________________________________________________________________________________________________
