Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 4, 400, 1)]  0                                            
__________________________________________________________________________________________________
Spectral_filter_1 (Conv2D)      (None, 4, 400, 2)    32          input_2[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_2 (Conv2D)      (None, 4, 400, 4)    128         input_2[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_3 (Conv2D)      (None, 4, 400, 8)    512         input_2[0][0]                    
__________________________________________________________________________________________________
Spectral_filter_4 (Conv2D)      (None, 4, 400, 16)   2048        input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 4, 400, 2)    8           Spectral_filter_1[0][0]          
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 4, 400, 4)    16          Spectral_filter_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 4, 400, 8)    32          Spectral_filter_3[0][0]          
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 4, 400, 16)   64          Spectral_filter_4[0][0]          
__________________________________________________________________________________________________
Spatial_filter_1 (DepthwiseConv (None, 1, 400, 2)    8           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
Spatial_filter_2 (DepthwiseConv (None, 1, 400, 4)    16          batch_normalization_19[0][0]     
__________________________________________________________________________________________________
Spatial_filter_3 (DepthwiseConv (None, 1, 400, 8)    32          batch_normalization_21[0][0]     
__________________________________________________________________________________________________
Spatial_filter_4 (DepthwiseConv (None, 1, 400, 16)   64          batch_normalization_23[0][0]     
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 1, 400, 2)    8           Spatial_filter_1[0][0]           
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 1, 400, 4)    16          Spatial_filter_2[0][0]           
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 1, 400, 8)    32          Spatial_filter_3[0][0]           
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 1, 400, 16)   64          Spatial_filter_4[0][0]           
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 1, 400, 2)    0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 1, 400, 4)    0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 1, 400, 8)    0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 1, 400, 16)   0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1, 400, 30)   0           activation_13[0][0]              
                                                                 activation_14[0][0]              
                                                                 activation_15[0][0]              
                                                                 activation_16[0][0]              
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 1, 100, 30)   0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 1, 100, 30)   0           average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Pad_8 (TensorFlowOp (None, 1, 103, 30)   0           dropout_11[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_8 (DepthwiseCo (None, 1, 100, 30)   150         tf_op_layer_Pad_8[0][0]          
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 1, 100, 30)   120         depthwise_conv2d_8[0][0]         
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 1, 100, 30)   0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 1, 100, 30)   0           activation_17[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_9 (TensorFlowOp (None, 1, 103, 30)   0           dropout_12[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_9 (DepthwiseCo (None, 1, 100, 30)   150         tf_op_layer_Pad_9[0][0]          
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 1, 100, 30)   120         depthwise_conv2d_9[0][0]         
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 1, 100, 30)   0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 1, 100, 30)   0           activation_18[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 1, 100, 30)   0           dropout_11[0][0]                 
                                                                 dropout_13[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Pad_10 (TensorFlowO (None, 1, 106, 30)   0           add_4[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_10 (DepthwiseC (None, 1, 100, 30)   150         tf_op_layer_Pad_10[0][0]         
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 1, 100, 30)   120         depthwise_conv2d_10[0][0]        
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 1, 100, 30)   0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 1, 100, 30)   0           activation_19[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_11 (TensorFlowO (None, 1, 106, 30)   0           dropout_14[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_11 (DepthwiseC (None, 1, 100, 30)   150         tf_op_layer_Pad_11[0][0]         
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 1, 100, 30)   120         depthwise_conv2d_11[0][0]        
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 1, 100, 30)   0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 1, 100, 30)   0           activation_20[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 1, 100, 30)   0           add_4[0][0]                      
                                                                 dropout_15[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Pad_12 (TensorFlowO (None, 1, 112, 30)   0           add_5[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_12 (DepthwiseC (None, 1, 100, 30)   150         tf_op_layer_Pad_12[0][0]         
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 1, 100, 30)   120         depthwise_conv2d_12[0][0]        
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 1, 100, 30)   0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 1, 100, 30)   0           activation_21[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_13 (TensorFlowO (None, 1, 112, 30)   0           dropout_16[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_13 (DepthwiseC (None, 1, 100, 30)   150         tf_op_layer_Pad_13[0][0]         
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 1, 100, 30)   120         depthwise_conv2d_13[0][0]        
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 1, 100, 30)   0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 1, 100, 30)   0           activation_22[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 1, 100, 30)   0           add_5[0][0]                      
                                                                 dropout_17[0][0]                 
__________________________________________________________________________________________________
tf_op_layer_Pad_14 (TensorFlowO (None, 1, 124, 30)   0           add_6[0][0]                      
__________________________________________________________________________________________________
depthwise_conv2d_14 (DepthwiseC (None, 1, 100, 30)   150         tf_op_layer_Pad_14[0][0]         
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 1, 100, 30)   120         depthwise_conv2d_14[0][0]        
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 1, 100, 30)   0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
dropout_18 (Dropout)            (None, 1, 100, 30)   0           activation_23[0][0]              
__________________________________________________________________________________________________
tf_op_layer_Pad_15 (TensorFlowO (None, 1, 124, 30)   0           dropout_18[0][0]                 
__________________________________________________________________________________________________
depthwise_conv2d_15 (DepthwiseC (None, 1, 100, 30)   150         tf_op_layer_Pad_15[0][0]         
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 1, 100, 30)   120         depthwise_conv2d_15[0][0]        
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 1, 100, 30)   0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
dropout_19 (Dropout)            (None, 1, 100, 30)   0           activation_24[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 1, 100, 30)   0           add_6[0][0]                      
                                                                 dropout_19[0][0]                 
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 1, 100, 28)   868         add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 1, 100, 28)   112         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 1, 100, 28)   0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 1, 25, 28)    0           activation_25[0][0]              
__________________________________________________________________________________________________
dropout_20 (Dropout)            (None, 1, 25, 28)    0           average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 700)          0           dropout_20[0][0]                 
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 7)            4907        flatten_1[0][0]                  
==================================================================================================
Total params: 11,127
Trainable params: 10,471
Non-trainable params: 656
__________________________________________________________________________________________________
